Dony-kylin/STM32H743/Expand/Src/ad7606_scope.c
#include "ad7606_scope.h"

#include "FreeRTOS.h"
#include "task.h"
#include "lcd_spi_154.h"
#include "stm32h7xx_hal.h"

#include <stdio.h>
#include <string.h>

/*
 * The acquisition task runs continuously at the AD7606 conversion rate.
 * A 4096-sample ring gives the LCD task enough history to find a clean
 * rising-edge trigger without slowing the converter down.
 */
#define SCOPE_RING_SIZE               4096U
#define SCOPE_RING_MASK               (SCOPE_RING_SIZE - 1U)
#define SCOPE_SNAPSHOT_LIMIT          3072U
#define SCOPE_SNAPSHOT_RETRIES        3U

#define SCOPE_GRAPH_X                 8U
#define SCOPE_GRAPH_Y                 44U
#define SCOPE_GRAPH_WIDTH             224U
#define SCOPE_GRAPH_HEIGHT            192U
#define SCOPE_BLIT_ROWS               16U
#define SCOPE_HORIZONTAL_DIVS         8U
#define SCOPE_VERTICAL_DIVS           8U
#define SCOPE_DEFAULT_MV_PER_DIV      200U
#define SCOPE_DEFAULT_REFRESH_MS      100U

#define SCOPE_COLOR_BLACK             0x0000U
#define SCOPE_COLOR_GRID              0x2125U
#define SCOPE_COLOR_AXIS              0x4208U
#define SCOPE_COLOR_BORDER            0x7BEFU
#define SCOPE_COLOR_WAVE              0xFFE0U

#define SCOPE_D2_RAM                  __attribute__((section(".scope_ram"), aligned(32)))

static int16_t scope_ring_samples[SCOPE_RING_SIZE] SCOPE_D2_RAM;
static uint32_t scope_ring_cycles[SCOPE_RING_SIZE] SCOPE_D2_RAM;
static int16_t scope_snapshot_samples[SCOPE_RING_SIZE] SCOPE_D2_RAM;
static uint32_t scope_snapshot_cycles[SCOPE_RING_SIZE] SCOPE_D2_RAM;
static uint16_t scope_graph[SCOPE_GRAPH_WIDTH * SCOPE_GRAPH_HEIGHT] SCOPE_D2_RAM;

static volatile uint32_t scope_write_count;
static uint32_t scope_decimation_count;
static uint32_t scope_full_scale_mv = 5000U;
static volatile uint32_t scope_channel_index;
static volatile uint32_t scope_mv_per_div;
static volatile uint32_t scope_decimation;
static volatile int32_t scope_center_mv;
static volatile uint32_t scope_time_per_div_us;
static volatile uint32_t scope_refresh_ms;
static volatile uint32_t scope_input_sample_rate_hz;
static volatile uint8_t scope_running;
static volatile uint8_t scope_center_auto;

static uint32_t ScopeTakeSnapshot(void);
static void ScopeAnalyzeAndRender(uint32_t count,
                                  const AD7606_ScopeConfig *config);
static uint32_t ScopeIntegerSqrt(uint64_t value);
static int32_t ScopeRawToMv(int32_t raw);
static uint16_t ScopeSampleToY(int16_t raw, uint32_t mv_per_div,
                               int32_t center_mv);
static void ScopeClearGraph(void);
static void ScopeDrawGrid(void);
static void ScopePutPixel(int32_t x, int32_t y, uint16_t color);
static void ScopeDrawLine(int32_t x0, int32_t y0,
                          int32_t x1, int32_t y1, uint16_t color);
static void ScopeDisplayText(uint16_t y, const char *text);
static void ScopeBlitGraph(void);

void AD7606_ScopeInit(uint32_t full_scale_mv)
{
  scope_full_scale_mv = (full_scale_mv == 10000U) ? 10000U : 5000U;
  scope_write_count = 0U;
  scope_decimation_count = 0U;
  scope_channel_index = 0U;
  scope_mv_per_div = SCOPE_DEFAULT_MV_PER_DIV;
  scope_decimation = AD7606_SCOPE_DECIMATION;
  scope_center_mv = 0;
  scope_time_per_div_us = 0U;
  scope_refresh_ms = SCOPE_DEFAULT_REFRESH_MS;
  scope_input_sample_rate_hz = 0U;
  scope_running = 1U;
  scope_center_auto = 0U;

  /* CYCCNT provides sub-microsecond timestamps without consuming a timer. */
  CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
  DWT->CYCCNT = 0U;
  DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

void AD7606_ScopePushFrame(const int16_t *channels)
{
  uint32_t decimation;
  uint32_t channel;
  uint32_t write_count;
  uint32_t index;

  if ((channels == NULL) || (scope_running == 0U))
  {
    return;
  }

  ++scope_decimation_count;
  decimation = scope_decimation;
  if (scope_decimation_count < decimation)
  {
    return;
  }
  scope_decimation_count = 0U;

  channel = scope_channel_index;
  write_count = scope_write_count;
  index = write_count & SCOPE_RING_MASK;

  scope_ring_samples[index] = channels[channel];
  scope_ring_cycles[index] = DWT->CYCCNT;
  __DMB();
  scope_write_count = write_count + 1U;
}

void AD7606_ScopeGetConfig(AD7606_ScopeConfig *config)
{
  if (config == NULL)
  {
    return;
  }

  taskENTER_CRITICAL();
  config->channel = (uint8_t)(scope_channel_index + 1U);
  config->running = scope_running;
  config->center_auto = scope_center_auto;
  config->reserved = 0U;
  config->mv_per_div = (uint16_t)scope_mv_per_div;
  config->decimation = (uint16_t)scope_decimation;
  config->center_mv = scope_center_mv;
  config->time_per_div_us = scope_time_per_div_us;
  config->refresh_ms = scope_refresh_ms;
  taskEXIT_CRITICAL();
}

uint8_t AD7606_ScopeSetChannel(uint32_t channel)
{
  if ((channel < 1U) || (channel > 8U))
  {
    return 0U;
  }

  taskENTER_CRITICAL();
  scope_channel_index = channel - 1U;
  scope_write_count = 0U;
  scope_decimation_count = 0U;
  taskEXIT_CRITICAL();
  return 1U;
}

uint8_t AD7606_ScopeSetMvPerDiv(uint32_t mv_per_div)
{
  if ((mv_per_div != 50U) && (mv_per_div != 100U) &&
      (mv_per_div != 200U) && (mv_per_div != 500U) &&
      (mv_per_div != 1000U) && (mv_per_div != 2000U))
  {
    return 0U;
  }

  scope_mv_per_div = mv_per_div;
  return 1U;
}

uint8_t AD7606_ScopeSetDecimation(uint32_t decimation)
{
  if ((decimation != 1U) && (decimation != 2U) &&
      (decimation != 4U) && (decimation != 8U) &&
      (decimation != 16U) && (decimation != 32U) &&
      (decimation != 64U))
  {
    return 0U;
  }

  taskENTER_CRITICAL();
  scope_decimation = decimation;
  scope_write_count = 0U;
  scope_decimation_count = 0U;
  taskEXIT_CRITICAL();
  return 1U;
}

uint8_t AD7606_ScopeSetCenterMv(int32_t center_mv)
{
  if ((center_mv < -(int32_t)scope_full_scale_mv) ||
      (center_mv > (int32_t)scope_full_scale_mv))
  {
    return 0U;
  }

  taskENTER_CRITICAL();
  scope_center_mv = center_mv;
  scope_center_auto = 0U;
  taskEXIT_CRITICAL();
  return 1U;
}

void AD7606_ScopeSetCenterAuto(uint8_t automatic)
{
  taskENTER_CRITICAL();
  scope_center_auto = (automatic != 0U) ? 1U : 0U;
  taskEXIT_CRITICAL();
}

uint8_t AD7606_ScopeSetTimePerDivUs(uint32_t time_per_div_us)
{
  if ((time_per_div_us != 0U) &&
      ((time_per_div_us < 10U) || (time_per_div_us > 1000000U)))
  {
    return 0U;
  }

  scope_time_per_div_us = time_per_div_us;
  return 1U;
}

