Dony-kylin/STM32H743/Expand/Src/ad7606_scope.c
uint8_t AD7606_ScopeSetRefreshMs(uint32_t refresh_ms)
{
  if ((refresh_ms < 50U) || (refresh_ms > 2000U))
  {
    return 0U;
  }

  scope_refresh_ms = refresh_ms;
  return 1U;
}

void AD7606_ScopeSetRunning(uint8_t running)
{
  taskENTER_CRITICAL();
  if ((running != 0U) && (scope_running == 0U))
  {
    scope_write_count = 0U;
    scope_decimation_count = 0U;
  }
  scope_running = (running != 0U) ? 1U : 0U;
  taskEXIT_CRITICAL();
}

uint32_t AD7606_ScopeGetRefreshMs(void)
{
  return scope_refresh_ms;
}

uint32_t AD7606_ScopeGetInputSampleRateHz(void)
{
  return scope_input_sample_rate_hz;
}

uint8_t AD7606_ScopeAutoConfigure(void)
{
  static const uint32_t vdiv_options[] =
      {50U, 100U, 200U, 500U, 1000U, 2000U};
  static const uint32_t decimation_options[] =
      {64U, 32U, 16U, 8U, 4U, 2U, 1U};
  uint32_t count = ScopeTakeSnapshot();
  int16_t minimum;
  int16_t maximum;
  int64_t sum = 0;
  int32_t mean;
  int32_t midpoint;
  int32_t positive_peak;
  int32_t negative_peak;
  uint32_t peak_mv;
  uint32_t selected_vdiv = 2000U;
  uint32_t selected_decimation = scope_decimation;
  uint32_t display_sample_rate_hz = 0U;
  uint32_t input_sample_rate_hz = 0U;
  uint32_t frequency_hz = 0U;
  uint32_t first_crossing = 0U;
  uint32_t last_crossing = 0U;
  uint32_t crossing_count = 0U;
  int32_t hysteresis;
  uint8_t trigger_armed = 0U;

  if (count < SCOPE_GRAPH_WIDTH)
  {
    return 0U;
  }

  minimum = scope_snapshot_samples[0];
  maximum = scope_snapshot_samples[0];
  for (uint32_t i = 0U; i < count; ++i)
  {
    int32_t value = scope_snapshot_samples[i];
    if (value < minimum)
    {
      minimum = (int16_t)value;
    }
    if (value > maximum)
    {
      maximum = (int16_t)value;
    }
    sum += value;
  }
  mean = (int32_t)(sum / (int64_t)count);
  midpoint = ((int32_t)maximum + minimum) / 2;
  positive_peak = (int32_t)maximum - midpoint;
  negative_peak = midpoint - (int32_t)minimum;
  peak_mv = (uint32_t)ScopeRawToMv(
      (positive_peak > negative_peak) ? positive_peak : negative_peak);

  for (uint32_t i = 0U;
       i < (sizeof(vdiv_options) / sizeof(vdiv_options[0])); ++i)
  {
    if (peak_mv <= (vdiv_options[i] * 3U))
    {
      selected_vdiv = vdiv_options[i];
      break;
    }
  }

  {
    uint32_t elapsed_cycles =
        scope_snapshot_cycles[count - 1U] - scope_snapshot_cycles[0];
    if (elapsed_cycles != 0U)
    {
      display_sample_rate_hz = (uint32_t)
          (((uint64_t)(count - 1U) * SystemCoreClock) / elapsed_cycles);
      input_sample_rate_hz = display_sample_rate_hz * scope_decimation;
    }
  }

  hysteresis = ((int32_t)maximum - (int32_t)minimum) / 20;
  if (hysteresis < 8)
  {
    hysteresis = 8;
  }
  for (uint32_t i = 0U; i < count; ++i)
  {
    int32_t value = scope_snapshot_samples[i];
    if (value <= (mean - hysteresis))
    {
      trigger_armed = 1U;
    }
    else if ((trigger_armed != 0U) && (value >= (mean + hysteresis)))
    {
      if (crossing_count == 0U)
      {
        first_crossing = i;
      }
      last_crossing = i;
      ++crossing_count;
      trigger_armed = 0U;
    }
  }

  if ((crossing_count >= 2U) && (last_crossing > first_crossing))
  {
    uint32_t elapsed_cycles =
        scope_snapshot_cycles[last_crossing] -
        scope_snapshot_cycles[first_crossing];
    uint32_t periods = crossing_count - 1U;
    if (elapsed_cycles != 0U)
    {
      frequency_hz = (uint32_t)
          (((uint64_t)SystemCoreClock * periods) / elapsed_cycles);
    }
  }

  if ((frequency_hz != 0U) && (input_sample_rate_hz != 0U))
  {
    /*
     * Prefer the largest reduction that still leaves at least 40 displayed
     * samples per cycle. If the input is too fast even for that target, keep
     * every ADC sample instead of retaining a slower previous setting.
     */
    selected_decimation = 1U;
    for (uint32_t i = 0U;
         i < (sizeof(decimation_options) /
              sizeof(decimation_options[0])); ++i)
    {
      if ((uint64_t)input_sample_rate_hz >=
          ((uint64_t)frequency_hz * 40U * decimation_options[i]))
      {
        selected_decimation = decimation_options[i];
        break;
      }
    }
  }

  taskENTER_CRITICAL();
  scope_mv_per_div = selected_vdiv;
  scope_center_mv = ScopeRawToMv(midpoint);
  scope_center_auto = 1U;
  scope_time_per_div_us = 0U;
  if (scope_decimation != selected_decimation)
  {
    scope_decimation = selected_decimation;
    scope_write_count = 0U;
    scope_decimation_count = 0U;
  }
  taskEXIT_CRITICAL();
  return 1U;
}

void AD7606_ScopeDisplayInit(void)
{
  LCD_SetDirection(Direction_V);
  LCD_SetBackColor(LCD_BLACK);
  LCD_SetColor(LCD_WHITE);
  LCD_SetAsciiFont(&ASCII_Font12);
  LCD_ShowNumMode(Fill_Space);
  LCD_Clear();

  ScopeDisplayText(2U, "CH1  200mV/div  Fs:---");
  ScopeDisplayText(16U, "Max:---mV Min:---mV");
  ScopeDisplayText(30U, "Mid:---mV Vpp:---mV RMS:---mV");
  ScopeDisplayText(238U, "F:---Hz DC:---mV C:+0mV");

  ScopeClearGraph();
  ScopeDrawGrid();
  ScopeBlitGraph();
}

void AD7606_ScopeDisplayRefresh(void)
{
  AD7606_ScopeConfig config;
  uint32_t count = ScopeTakeSnapshot();

  AD7606_ScopeGetConfig(&config);
  if (count < SCOPE_GRAPH_WIDTH)
  {
    char line[40];
    (void)snprintf(line, sizeof(line), "%sCH%u  waiting for signal",
                   (config.running != 0U) ? "" : "HOLD ",
                   config.channel);
    ScopeDisplayText(2U, line);
    return;
  }

  ScopeAnalyzeAndRender(count, &config);
}

static uint32_t ScopeTakeSnapshot(void)
{
  /*
   * Keep enough unused ring entries ahead of the snapshot so the 200 kSPS
   * BUSY interrupt can continue writing while the LCD copies history. This
   * avoids a long critical section that would otherwise hide BUSY edges.
   */
  for (uint32_t attempt = 0U; attempt < SCOPE_SNAPSHOT_RETRIES; ++attempt)
  {
    uint32_t end = scope_write_count;
    uint32_t count = (end < SCOPE_SNAPSHOT_LIMIT) ?
                     end : SCOPE_SNAPSHOT_LIMIT;
    uint32_t first = end - count;

    for (uint32_t i = 0U; i < count; ++i)
    {
      uint32_t source = (first + i) & SCOPE_RING_MASK;
      scope_snapshot_samples[i] = scope_ring_samples[source];
      scope_snapshot_cycles[i] = scope_ring_cycles[source];
    }

    __DMB();
    if ((scope_write_count - end) <= (SCOPE_RING_SIZE - count))
    {
      return count;
    }
  }
  return 0U;
}

static void ScopeAnalyzeAndRender(uint32_t count,
                                  const AD7606_ScopeConfig *config)
{
  int16_t minimum = scope_snapshot_samples[0];
  int16_t maximum = scope_snapshot_samples[0];
  int64_t sum = 0;
  uint64_t sum_squares = 0U;
  int32_t mean;
  int32_t midpoint;
  int32_t display_center_mv;
  uint64_t variance;
  uint32_t rms_raw;
  uint32_t display_sample_rate_hz = 0U;
  uint32_t input_sample_rate_hz = 0U;
  uint32_t frequency_millihz = 0U;
  uint32_t crossings[16];
  uint32_t crossing_count = 0U;
  uint32_t period_samples = 0U;
  uint32_t plot_span = SCOPE_GRAPH_WIDTH - 1U;
  uint32_t plot_start = count - SCOPE_GRAPH_WIDTH;
  int32_t hysteresis;
  uint8_t trigger_armed = 0U;
  char line[64];
  char timebase[16];

  for (uint32_t i = 0U; i < count; ++i)
  {
    int32_t value = scope_snapshot_samples[i];
    if (value < minimum)
    {
      minimum = (int16_t)value;
    }
    if (value > maximum)
    {
      maximum = (int16_t)value;
    }
    sum += value;
    sum_squares += (uint64_t)((int64_t)value * value);
  }

  mean = (int32_t)(sum / (int64_t)count);
  midpoint = ((int32_t)maximum + (int32_t)minimum) / 2;
  display_center_mv = (config->center_auto != 0U) ?
                      ScopeRawToMv(mean) : config->center_mv;
  {
    int64_t mean_square = (int64_t)(sum_squares / count);
    int64_t dc_square = (int64_t)mean * mean;
    variance = (mean_square > dc_square) ?
               (uint64_t)(mean_square - dc_square) : 0U;
  }
  rms_raw = ScopeIntegerSqrt(variance);

  {
    uint32_t elapsed_cycles =
        scope_snapshot_cycles[count - 1U] - scope_snapshot_cycles[0];
    if (elapsed_cycles != 0U)
    {
      display_sample_rate_hz = (uint32_t)
          (((uint64_t)(count - 1U) * SystemCoreClock) / elapsed_cycles);
    }
  }
  input_sample_rate_hz = display_sample_rate_hz * config->decimation;
  scope_input_sample_rate_hz = input_sample_rate_hz;

