Dony-kylin/STM32H743/Expand/Src/ad7606_scope.c
  /*
   * A Schmitt-style trigger rejects small zero-crossing noise. The trigger
   * follows the measured DC mean independently of the selected display
   * center voltage.
   */
  hysteresis = ((int32_t)maximum - (int32_t)minimum) / 20;
  if (hysteresis < 8)
  {
    hysteresis = 8;
  }

  for (uint32_t i = 0U; i < count; ++i)
  {
    int32_t value = scope_snapshot_samples[i];
    if (value <= (mean - hysteresis))
    {
      trigger_armed = 1U;
    }
    else if ((trigger_armed != 0U) && (value >= (mean + hysteresis)))
    {
      if (crossing_count < (sizeof(crossings) / sizeof(crossings[0])))
      {
        crossings[crossing_count++] = i;
      }
      else
      {
        memmove(&crossings[0], &crossings[1],
                (sizeof(crossings) / sizeof(crossings[0]) - 1U) *
                sizeof(crossings[0]));
        crossings[(sizeof(crossings) / sizeof(crossings[0])) - 1U] = i;
      }
      trigger_armed = 0U;
    }
  }

  if (crossing_count >= 2U)
  {
    uint32_t first_period = (crossing_count > 6U) ?
                            (crossing_count - 6U) : 1U;
    uint32_t periods = crossing_count - first_period;
    uint32_t total_samples =
        crossings[crossing_count - 1U] - crossings[first_period - 1U];
    uint32_t total_cycles =
        scope_snapshot_cycles[crossings[crossing_count - 1U]] -
        scope_snapshot_cycles[crossings[first_period - 1U]];

    if ((periods != 0U) && (total_samples != 0U))
    {
      period_samples = total_samples / periods;
    }
    if ((periods != 0U) && (total_cycles != 0U))
    {
      uint32_t average_period_cycles = total_cycles / periods;
      if (average_period_cycles != 0U)
      {
        frequency_millihz = (uint32_t)
            (((uint64_t)SystemCoreClock * 1000U) / average_period_cycles);
      }
    }
  }

  {
    uint64_t desired_span = 0U;

    if ((config->time_per_div_us != 0U) &&
        (display_sample_rate_hz != 0U))
    {
      desired_span = ((uint64_t)display_sample_rate_hz *
                      config->time_per_div_us *
                      SCOPE_HORIZONTAL_DIVS) / 1000000U;
      if (desired_span == 0U)
      {
        desired_span = 1U;
      }
    }
    else if (period_samples != 0U)
    {
      desired_span = (uint64_t)period_samples * 2U;
    }

    if (desired_span != 0U)
    {
      if (desired_span > (count - 1U))
      {
        desired_span = count - 1U;
      }
      if (desired_span == 0U)
      {
        desired_span = 1U;
      }
      plot_span = (uint32_t)desired_span;
    }
  }

  {
    uint32_t required_pre = plot_span / 8U;
    uint32_t required_post = plot_span - required_pre;

    plot_start = count - 1U - plot_span;

    for (uint32_t n = crossing_count; n > 0U; --n)
    {
      uint32_t crossing = crossings[n - 1U];
      if ((crossing >= required_pre) &&
          ((count - 1U - crossing) >= required_post))
      {
        plot_start = crossing - required_pre;
        break;
      }
    }
  }

  ScopeClearGraph();
  ScopeDrawGrid();

  {
    uint16_t previous_y =
        ScopeSampleToY(scope_snapshot_samples[plot_start],
                       config->mv_per_div, display_center_mv);
    for (uint32_t x = 1U; x < SCOPE_GRAPH_WIDTH; ++x)
    {
      uint32_t sample_index = plot_start + (uint32_t)
          (((uint64_t)x * plot_span) / (SCOPE_GRAPH_WIDTH - 1U));
      uint16_t y = ScopeSampleToY(scope_snapshot_samples[sample_index],
                                  config->mv_per_div, display_center_mv);
      ScopeDrawLine((int32_t)x - 1, previous_y,
                    (int32_t)x, y, SCOPE_COLOR_WAVE);
      previous_y = y;
    }
  }

  ScopeBlitGraph();

  if (config->time_per_div_us == 0U)
  {
    (void)snprintf(timebase, sizeof(timebase), "AUTO");
  }
  else if ((config->time_per_div_us >= 1000U) &&
           ((config->time_per_div_us % 1000U) == 0U))
  {
    (void)snprintf(timebase, sizeof(timebase), "%lums/d",
                   (unsigned long)(config->time_per_div_us / 1000U));
  }
  else
  {
    (void)snprintf(timebase, sizeof(timebase), "%luus/d",
                   (unsigned long)config->time_per_div_us);
  }

  if (input_sample_rate_hz >= 1000U)
  {
    (void)snprintf(line, sizeof(line), "%sCH%u %umV/d %s Fs:%lu.%luk",
                   (config->running != 0U) ? "" : "HOLD ",
                   (unsigned int)config->channel,
                   (unsigned int)config->mv_per_div, timebase,
                   (unsigned long)(input_sample_rate_hz / 1000U),
                   (unsigned long)((input_sample_rate_hz % 1000U) / 100U));
  }
  else
  {
    (void)snprintf(line, sizeof(line), "%sCH%u %umV/d %s Fs:%luHz",
                   (config->running != 0U) ? "" : "HOLD ",
                   (unsigned int)config->channel,
                   (unsigned int)config->mv_per_div, timebase,
                   (unsigned long)input_sample_rate_hz);
  }
  ScopeDisplayText(2U, line);

  (void)snprintf(line, sizeof(line), "Max:%+ldmV Min:%+ldmV",
                 (long)ScopeRawToMv(maximum),
                 (long)ScopeRawToMv(minimum));
  ScopeDisplayText(16U, line);

  (void)snprintf(line, sizeof(line),
                 "Mid:%+ldmV Vpp:%ldmV RMS:%ldmV",
                 (long)ScopeRawToMv(midpoint),
                 (long)ScopeRawToMv((int32_t)maximum - minimum),
                 (long)ScopeRawToMv((int32_t)rms_raw));
  ScopeDisplayText(30U, line);

  if (frequency_millihz >= 1000000U)
  {
    (void)snprintf(line, sizeof(line), "F:%lu.%lukHz DC:%+ldmV C:%s%+ldmV",
                   (unsigned long)(frequency_millihz / 1000000U),
                   (unsigned long)((frequency_millihz % 1000000U) / 100000U),
                   (long)ScopeRawToMv(mean),
                   (config->center_auto != 0U) ? "A" : "",
                   (long)display_center_mv);
  }
  else if (frequency_millihz != 0U)
  {
    (void)snprintf(line, sizeof(line), "F:%lu.%luHz DC:%+ldmV C:%s%+ldmV",
                   (unsigned long)(frequency_millihz / 1000U),
                   (unsigned long)((frequency_millihz % 1000U) / 100U),
                   (long)ScopeRawToMv(mean),
                   (config->center_auto != 0U) ? "A" : "",
                   (long)display_center_mv);
  }
  else
  {
    (void)snprintf(line, sizeof(line), "F:---Hz DC:%+ldmV C:%s%+ldmV",
                   (long)ScopeRawToMv(mean),
                   (config->center_auto != 0U) ? "A" : "",
                   (long)display_center_mv);
  }
  ScopeDisplayText(238U, line);
}

static uint32_t ScopeIntegerSqrt(uint64_t value)
{
  uint64_t result = 0U;
  uint64_t bit = (uint64_t)1U << 62;

  while (bit > value)
  {
    bit >>= 2;
  }

  while (bit != 0U)
  {
    if (value >= (result + bit))
    {
      value -= result + bit;
      result = (result >> 1) + bit;
    }
    else
    {
      result >>= 1;
    }
    bit >>= 2;
  }

  return (uint32_t)result;
}

