Dony-kylin/STM32H743/Expand/Src/ad7606_scope.c
static int32_t ScopeRawToMv(int32_t raw)
{
  int64_t scaled = (int64_t)raw * scope_full_scale_mv;
  if (scaled >= 0)
  {
    scaled += 16384;
  }
  else
  {
    scaled -= 16384;
  }
  return (int32_t)(scaled / 32768);
}

static uint16_t ScopeSampleToY(int16_t raw, uint32_t mv_per_div,
                               int32_t center_mv)
{
  int32_t millivolts = ScopeRawToMv(raw) - center_mv;
  int32_t center = (int32_t)(SCOPE_GRAPH_HEIGHT / 2U);
  int32_t pixels_per_div =
      (int32_t)(SCOPE_GRAPH_HEIGHT / SCOPE_VERTICAL_DIVS);
  int32_t y = center -
      (millivolts * pixels_per_div) / (int32_t)mv_per_div;

  if (y < 1)
  {
    y = 1;
  }
  else if (y > ((int32_t)SCOPE_GRAPH_HEIGHT - 2))
  {
    y = (int32_t)SCOPE_GRAPH_HEIGHT - 2;
  }
  return (uint16_t)y;
}

static void ScopeClearGraph(void)
{
  for (uint32_t i = 0U;
       i < (SCOPE_GRAPH_WIDTH * SCOPE_GRAPH_HEIGHT); ++i)
  {
    scope_graph[i] = SCOPE_COLOR_BLACK;
  }
}

static void ScopeDrawGrid(void)
{
  uint32_t x_div = SCOPE_GRAPH_WIDTH / SCOPE_HORIZONTAL_DIVS;
  uint32_t y_div = SCOPE_GRAPH_HEIGHT / SCOPE_VERTICAL_DIVS;

  for (uint32_t division = 0U;
       division <= SCOPE_HORIZONTAL_DIVS; ++division)
  {
    uint32_t x = division * x_div;
    if (x >= SCOPE_GRAPH_WIDTH)
    {
      x = SCOPE_GRAPH_WIDTH - 1U;
    }
    for (uint32_t y = 0U; y < SCOPE_GRAPH_HEIGHT; ++y)
    {
      scope_graph[y * SCOPE_GRAPH_WIDTH + x] =
          ((division == 0U) || (division == SCOPE_HORIZONTAL_DIVS)) ?
          SCOPE_COLOR_BORDER : SCOPE_COLOR_GRID;
    }
  }

  for (uint32_t division = 0U;
       division <= SCOPE_VERTICAL_DIVS; ++division)
  {
    uint32_t y = division * y_div;
    uint16_t color;
    if (y >= SCOPE_GRAPH_HEIGHT)
    {
      y = SCOPE_GRAPH_HEIGHT - 1U;
    }

    if ((division == 0U) || (division == SCOPE_VERTICAL_DIVS))
    {
      color = SCOPE_COLOR_BORDER;
    }
    else if (division == (SCOPE_VERTICAL_DIVS / 2U))
    {
      color = SCOPE_COLOR_AXIS;
    }
    else
    {
      color = SCOPE_COLOR_GRID;
    }

    for (uint32_t x = 0U; x < SCOPE_GRAPH_WIDTH; ++x)
    {
      scope_graph[y * SCOPE_GRAPH_WIDTH + x] = color;
    }
  }
}

static void ScopePutPixel(int32_t x, int32_t y, uint16_t color)
{
  if ((x >= 0) && (x < (int32_t)SCOPE_GRAPH_WIDTH) &&
      (y >= 0) && (y < (int32_t)SCOPE_GRAPH_HEIGHT))
  {
    scope_graph[(uint32_t)y * SCOPE_GRAPH_WIDTH + (uint32_t)x] = color;
  }
}

static void ScopeDrawLine(int32_t x0, int32_t y0,
                          int32_t x1, int32_t y1, uint16_t color)
{
  int32_t dx = (x1 >= x0) ? (x1 - x0) : (x0 - x1);
  int32_t sx = (x0 < x1) ? 1 : -1;
  int32_t dy_abs = (y1 >= y0) ? (y1 - y0) : (y0 - y1);
  int32_t dy = -dy_abs;
  int32_t sy = (y0 < y1) ? 1 : -1;
  int32_t error = dx + dy;

  for (;;)
  {
    ScopePutPixel(x0, y0, color);
    if ((x0 == x1) && (y0 == y1))
    {
      break;
    }

    {
      int32_t twice_error = 2 * error;
      if (twice_error >= dy)
      {
        error += dy;
        x0 += sx;
      }
      if (twice_error <= dx)
      {
        error += dx;
        y0 += sy;
      }
    }
  }
}

static void ScopeDisplayText(uint16_t y, const char *text)
{
  char padded[40];
  size_t length = strlen(text);

  if (length > 39U)
  {
    length = 39U;
  }
  memset(padded, ' ', sizeof(padded));
  memcpy(padded, text, length);
  padded[39] = '\0';

  LCD_SetBackColor(LCD_BLACK);
  LCD_SetColor(LCD_WHITE);
  LCD_DisplayString(2U, y, padded);
}

static void ScopeBlitGraph(void)
{
  /*
   * The LCD driver's polling transfer has a cumulative one-second timeout.
   * Small strips keep each transaction bounded when the ADC task preempts the
   * LCD task, and avoid leaving only the first part of a frame on the panel.
   */
  for (uint32_t row = 0U; row < SCOPE_GRAPH_HEIGHT;
       row += SCOPE_BLIT_ROWS)
  {
    uint32_t rows = SCOPE_GRAPH_HEIGHT - row;
    if (rows > SCOPE_BLIT_ROWS)
    {
      rows = SCOPE_BLIT_ROWS;
    }

    LCD_CopyBuffer(SCOPE_GRAPH_X, SCOPE_GRAPH_Y + (uint16_t)row,
                   SCOPE_GRAPH_WIDTH, (uint16_t)rows,
                   &scope_graph[row * SCOPE_GRAPH_WIDTH]);
  }
}
